In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({"col1":[1,2,3,4], "col2": [444,555,666,444], "col3":["abc", "def", "ghi", "xyz"]})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [6]:
df.index

RangeIndex(start=0, stop=4, step=1)

## Column selection

### Bracket notation

#### List of column names

In [7]:
df["col1"] # df["col1"], sonuç pd. Serisidir. Bracket notation

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [8]:
type(df["col1"])

pandas.core.series.Series

### Point notation

In [9]:
df.col1 # aynı sonucu verir.

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [11]:
type(df.col1)

pandas.core.series.Series

### Multiple column selection

#### Selection brackets []

Birden fazla sütun için, bracket notationa liste eklenir. df[["col1", "col2"]] olur. İki bracket
To select multiple columns, use a list of column names within the selection brackets [].

In [12]:
df[["col1", "col2"]]

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

Note:The inner square brackets define a Python list with column names, whereas the outer brackets are used to select the data from a pandas DataFrame.

In [13]:
type(df.col1)

pandas.core.series.Series

In [14]:
type(df)

pandas.core.frame.DataFrame

## creating new column

In [4]:
df["new"] = df.col1 *2
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

### değişkene tanımla

In [5]:
city = ["Uşak", "Konya", "İstanbul", "Vire"]
df["city"] = city
df

   col1  col2 col3  new      city
0     1   444  abc    2      Uşak
1     2   555  def    4     Konya
2     3   666  ghi    6  İstanbul
3     4   444  xyz    8      Vire

### insert() method

Docstring: Insert column into DataFrame at specified location.

Raises a ValueError if `column` is already contained in the DataFrame, unless `allow_duplicates` is set to True.

df.insert(loc, column, value, allow_duplicates=False)

In [6]:
df.insert(1, "Hobby", ["Football", "Tennis", "Game", "Trekking"])
df

   col1     Hobby  col2 col3  new      city
0     1  Football   444  abc    2      Uşak
1     2    Tennis   555  def    4     Konya
2     3      Game   666  ghi    6  İstanbul
3     4  Trekking   444  xyz    8      Vire

### assign() method

Docstring: Assign new columns to a DataFrame.

Returns a new object with all original columns in addition to new ones.
Existing columns that are re-assigned will be overwritten.

In [24]:
df = pd.DataFrame({'temp_c': [17.0, 25.0]}, index=['Portland', 'Berkeley'])
df

          temp_c
Portland    17.0
Berkeley    25.0

Where the value is a callable, evaluated on `df`:

In [37]:
df.assign(temp_f=lambda x: x.temp_c * 9 / 5 + 32)

          temp_c  temp_f
Portland    17.0    62.6
Berkeley    25.0    77.0

Alternatively, the same behavior can be achieved by directly referencing an existing Series or sequence:

In [39]:
df.assign(temp_f=df['temp_c'] * 9 / 5 + 32)

          temp_c  temp_f
Portland    17.0    62.6
Berkeley    25.0    77.0

You can create multiple columns within the same assign where one of the columns depends on another one defined within the same assign:

In [40]:
df.assign(temp_f=lambda x: x['temp_c'] * 9 / 5 + 32,
          temp_k=lambda x: (x['temp_f'] +  459.67) * 5 / 9)

          temp_c  temp_f  temp_k
Portland    17.0    62.6  290.15
Berkeley    25.0    77.0  298.15

In [7]:
df.assign(name = ['John', 'Mike', 'Mary', 'Kevin'])

   col1     Hobby  col2 col3  new      city   name
0     1  Football   444  abc    2      Uşak   John
1     2    Tennis   555  def    4     Konya   Mike
2     3      Game   666  ghi    6  İstanbul   Mary
3     4  Trekking   444  xyz    8      Vire  Kevin

In [8]:
df

   col1     Hobby  col2 col3  new      city
0     1  Football   444  abc    2      Uşak
1     2    Tennis   555  def    4     Konya
2     3      Game   666  ghi    6  İstanbul
3     4  Trekking   444  xyz    8      Vire

In [9]:
df = df.assign(name = ['John', 'Mike', 'Mary', 'Kevin']) 
df

   col1     Hobby  col2 col3  new      city   name
0     1  Football   444  abc    2      Uşak   John
1     2    Tennis   555  def    4     Konya   Mike
2     3      Game   666  ghi    6  İstanbul   Mary
3     4  Trekking   444  xyz    8      Vire  Kevin

### Mevcut columnlardan yeni üretim

In [11]:
df["nerelisin hemşo"] = df.city + "'lı " + df.name
df

   col1     Hobby  col2 col3  new      city   name   nerelisin hemşo
0     1  Football   444  abc    2      Uşak   John      Uşak'lı John
1     2    Tennis   555  def    4     Konya   Mike     Konya'lı Mike
2     3      Game   666  ghi    6  İstanbul   Mary  İstanbul'lı Mary
3     4  Trekking   444  xyz    8      Vire  Kevin     Vire'lı Kevin

### adding a row

In [12]:
new = {"col1":5, "Hobby":"Pottery", "col2":777, "new":9, "city": "uşşağ", "name": "hüso", "hemşo": "uşşağlı hüso"}
df = df.append(new, ignore_index=True)
df

,col1,Hobby,col2,col3,new,city,name,nerelisin hemşo,hemşo
0,1,Football,444,abc,2,Uşak,John,Uşak'lı John,NaN
1,2,Tennis,555,def,4,Konya,Mike,Konya'lı Mike,NaN
2,3,Game,666,ghi,6,İstanbul,Mary,İstanbul'lı Mary,NaN
3,4,Trekking,444,xyz,8,Vire,Kevin,Vire'lı Kevin,NaN
4,5,Pottery,777,NaN,9,uşşağ,hüso,NaN,uşşağlı hüso

### drop the column

drop() metodu ile: Drop specified labels from rows or columns.

In [13]:
df.drop(labels = "new", axis=1, inplace =True)
df

   col1     Hobby  col2 col3      city   name   nerelisin hemşo         hemşo
0     1  Football   444  abc      Uşak   John      Uşak'lı John           NaN
1     2    Tennis   555  def     Konya   Mike     Konya'lı Mike           NaN
2     3      Game   666  ghi  İstanbul   Mary  İstanbul'lı Mary           NaN
3     4  Trekking   444  xyz      Vire  Kevin     Vire'lı Kevin           NaN
4     5   Pottery   777  NaN     uşşağ   hüso               NaN  uşşağlı hüso

Drop listeyi o an değiştirir. Tamamen değiştirmek için inplace=True yapmak gerekir. 
Parametreler: Labels: hangi sütun/satır, Axis: x or y, İndex, Column	
	Neden x zero axis, y 1 axis
	Becuse of shape property

In [14]:
df.shape
#(5, 4)5 rows, 0'ncı index, 4 columns, 1'inci index

(5, 8)

### permanently removing a column

In [19]:
del df["col3"]
df

   col1     Hobby  col2      city
0     1  Football   444      Uşak
1     2    Tennis   555     Konya
2     3      Game   666  İstanbul
3     4  Trekking   444      Vire

### drop the row

In [16]:
df = pd.DataFrame({"col1":[1,2,3,4], "col2": [444,555,666,444], "col3":["abc", "def", "ghi", "xyz"]})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [18]:
df.drop(labels = 3, inplace =True)
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi

### selecting rows

In [19]:
df = pd.DataFrame({"col1":[1,2,3,4], "col2": [444,555,666,444], "col3":["abc", "def", "ghi", "xyz"]})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [20]:
df.loc[0]

col1      1
col2    444
col3    abc
Name: 0, dtype: object

In [21]:
df.iloc[0]

col1      1
col2    444
col3    abc
Name: 0, dtype: object

selecting subset of columns

In [23]:
df.loc[0, "col1"]

1

In [24]:
df.loc[[0,2], ["col1","col2"]]

   col1  col2
0     1   444
2     3   666

In [25]:
df.index =["a", "b", "c", "d"]
df

   col1  col2 col3
a     1   444  abc
b     2   555  def
c     3   666  ghi
d     4   444  xyz

resetting index

In [26]:
df.reset_index(inplace = True)
df

  index  col1  col2 col3
0     a     1   444  abc
1     b     2   555  def
2     c     3   666  ghi
3     d     4   444  xyz

setting index

In [27]:
newin = "CA NY WY OR".split()
newin

['CA', 'NY', 'WY', 'OR']

In [28]:
df["States"] = newin
df

  index  col1  col2 col3 States
0     a     1   444  abc     CA
1     b     2   555  def     NY
2     c     3   666  ghi     WY
3     d     4   444  xyz     OR

In [29]:
df.set_index("States")

       index  col1  col2 col3
States
CA         a     1   444  abc
NY         b     2   555  def
WY         c     3   666  ghi
OR         d     4   444  xyz

## Selecting data

In [30]:
df

  index  col1  col2 col3 States
0     a     1   444  abc     CA
1     b     2   555  def     NY
2     c     3   666  ghi     WY
3     d     4   444  xyz     OR

In [32]:
(df.col1>2) & (df.col2 ==444)

0    False
1    False
2    False
3     True
dtype: bool

In [33]:
df[(df.col1>2) & (df.col2 ==444)]

  index  col1  col2 col3 States
3     d     4   444  xyz     OR

In [34]:
df.col1.sum()

10

In [ ]:
get column index

In [35]:
df.columns

Index(['index', 'col1', 'col2', 'col3', 'States'], dtype='object')

In [36]:
df.index

RangeIndex(start=0, stop=4, step=1)

sorting and ordering a dataframe

In [5]:
df = pd.DataFrame({"col1":[1,2,3,4], "col2": [444,555,666,444], "col3":["abc", "def", "ghi", "xyz"]})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [7]:
df.sort_values(by = "col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [8]:
label = ["G1", "G2", "G3", "G4", "G5", "G6"]
men_means = [20,34,30,35,27]
women_means=[25,32,34,20,25]
zip(label, men_means, women_means)
list(zip(label, men_means, women_means))
tuple(zip(label, men_means, women_means))
df = pd.DataFrame(list(zip(label, men_means, women_means)), columns = ["label", "men_means", "women_means"])
df

  label  men_means  women_means
0    G1         20           25
1    G2         34           32
2    G3         30           34
3    G4         35           20
4    G5         27           25

In [9]:
df.sort_values(by="men_means")

  label  men_means  women_means
0    G1         20           25
4    G5         27           25
2    G3         30           34
1    G2         34           32
3    G4         35           20

In [10]:
df.sort_values(by="men_means").label

0    G1
4    G5
2    G3
1    G2
3    G4
Name: label, dtype: object

In [11]:
df.sort_values(by ="women_means").label

3    G4
0    G1
4    G5
1    G2
2    G3
Name: label, dtype: object

multi index method

In [66]:
# index levels
outside = ["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [61]:
zip(outside, inside)

In [62]:
list(zip(outside, inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [68]:
hier_index = pd.MultiIndex.from_tuples(hier_index )
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [63]:
# pd.MultiIndex

In [65]:
arr = np.array([[1,1,2,2], ["red", "blue", "red", "blue"]])
arr
pd.MultiIndex.from_arrays(arr)

MultiIndex([('1',  'red'),
            ('1', 'blue'),
            ('2',  'red'),
            ('2', 'blue')],
           )

In [69]:
outside = ["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [70]:
df = pd.DataFrame(randn(6,2), hier_index)

In [71]:
outside = ["G1","G1","G1","G2","G2","G2"]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [72]:
df = pd.DataFrame(randn(6,2), hier_index, ["A", "B"])

In [73]:
df

             A         B
G1 1  0.749729  0.989920
   2  0.944052  0.255227
   3 -0.067854  1.165036
G2 1 -0.767479  0.132121
   2 -0.472565  0.495372
   3 -0.160067  0.038913

In [76]:
df.index.names = ["Groups", "Nums"]

In [77]:
df

                    A         B
Groups Nums
G1     1     0.749729  0.989920
       2     0.944052  0.255227
       3    -0.067854  1.165036
G2     1    -0.767479  0.132121
       2    -0.472565  0.495372
       3    -0.160067  0.038913

cross section function

In [78]:
df.xs("G1")

             A         B
Nums
1     0.749729  0.989920
2     0.944052  0.255227
3    -0.067854  1.165036

In [79]:
df.xs(1, level="Nums")

               A         B
Groups
G1      0.749729  0.989920
G2     -0.767479  0.132121

In [80]:
df

                    A         B
Groups Nums
G1     1     0.749729  0.989920
       2     0.944052  0.255227
       3    -0.067854  1.165036
G2     1    -0.767479  0.132121
       2    -0.472565  0.495372
       3    -0.160067  0.038913

## Conditional selection

In [3]:
df=pd.DataFrame({"col1": [1,2,3,4],
                "col2": [444,555,666,444],
                "col3": ["abc", "def", "ghi", "xyz"]})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df["col1"]

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [5]:
df["col1"]>2#returns boolean values
# df.col1 > 2 # dot notation

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [7]:
df[df.col1 >2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [8]:
df[df.col1 >2]["col1"]

2    3
3    4
Name: col1, dtype: int64

In [9]:
# combining conditions

In [13]:
df[(df["col1"]>2) & (df["col2"]==666)]

   col1  col2 col3
2     3   666  ghi

In [1]:
# example

In [18]:
df = pd.DataFrame({
    "cigarette": (0,5,10,15,np.nan,20),
    "lung_cap": (45,42,np.nan,33,31,29)
})
df
df[df["cigarette"]==5]["lung_cap"]

1    42.0
Name: lung_cap, dtype: float64

**Conditionals [IF / ELSE] in Pandas - create columns based on conditions**

In [2]:
names = "Martin", "Lisa", "Maxwell", "Manju", "Kenneth"
debts = 10,20,30,20,30
df = pd.DataFrame({"names":names, "debts": debts})
df

     names  debts
0   Martin     10
1     Lisa     20
2  Maxwell     30
3    Manju     20
4  Kenneth     30

In [3]:
df["interests"] = [i*0.2 if i<20 else i*0.4 for i in df.debts]

In [4]:
df

     names  debts  interests
0   Martin     10        2.0
1     Lisa     20        8.0
2  Maxwell     30       12.0
3    Manju     20        8.0
4  Kenneth     30       12.0

In [9]:
titanic= pd.read_csv("C:/Users/Owner/titanic.csv")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
type(titanic["Age"])

pandas.core.series.Series

In [12]:
titanic["Age"].shape

(891,)

In [13]:
titanic[["Age","Sex"]].head()

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

In [14]:
above35 = titanic["Age"]>35
above35.head()

0    False
1     True
2    False
3    False
4    False
Name: Age, dtype: bool

In [17]:
titanic[titanic["Age"]>35].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S

In [16]:
titanic.shape

(891, 12)

In [81]:
df = pd.DataFrame(data= [[1,2,3,4],[5,6,7,8], [9,10,11,12], [13,14,15,16]], index = ["a","b","c","d"], columns = ["ahmet", "mehmet", "veli", "hasan"])

In [82]:
df

   ahmet  mehmet  veli  hasan
a      1       2     3      4
b      5       6     7      8
c      9      10    11     12
d     13      14    15     16

In [89]:
df.assign(orhan=[3,6,9,12])

   ahmet  mehmet  veli  hasan  orhan
a      1       2     3      4      3
b      5       6     7      8      6
c      9      10    11     12      9
d     13      14    15     16     12

In [90]:
df

   ahmet  mehmet  veli  hasan
a      1       2     3      4
b      5       6     7      8
c      9      10    11     12
d     13      14    15     16

In [92]:
new = {"ahmet":11, "mehmet":12, "veli":13, "hasan":14}

In [93]:
df = df.append(new, ignore_index=True)

In [94]:
df

   ahmet  mehmet  veli  hasan
0      1       2     3      4
1      5       6     7      8
2      9      10    11     12
3     13      14    15     16
4     11      12    13     14

In [95]:
df = pd.DataFrame([[1,2], [4,5], [7,8]], index = ["kobra viper sidewinder".split()], columns = ["max_speed", "shield"])

In [96]:
df = pd.DataFrame({'var_1':['a','b','c'], 'var_2':[1, 2, 3], 'var_3':['apple', 'banana', 'pear']})
df
cols = ['var_1', 'var_2']    # Set columns to combine
df['combined'] = df[cols].apply(lambda row: ', '.join(row.values.astype(str)), axis=1)
# Define which column is index
df_i = df.set_index('combined') 
# Set the index to None
df_i.index.names = [None] 
df

  var_1  var_2   var_3 combined
0     a      1   apple     a, 1
1     b      2  banana     b, 2
2     c      3    pear     c, 3

In [1]:
import numpy as np
import pandas as pd

In [2]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Select the rows the score is between 15 and 20 (inclusive).

In [9]:
df[(15 < df.score) & (df.score <=20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [11]:
df[df.score.between(15,20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

and this is the only names of students

In [15]:
df[df.score.between(15,20)][["name"]]

        name
c  Katherine
f    Michael
j      Jonas

Select the rows where number of attempts in the examination is less than 2 and score greater than 15

In [13]:
df[(df.attempts <2) & (df.score > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

Calculate the sum of the examination attempts by the students.

In [14]:
df.attempts.sum()

19